/* 
▶ 문제 : Bone의 수가 너무 많아서 여러번 스키닝할경우 병목발생 
        + Motion Blur가 들어갈경우 처리해야할 Bone의 수가 2배로 늘어남 -> 처리불가할정도
        + 스키닝 병목으로 셰이더 상수 전송에 문제가 생긴다. 

▶ 해결방안 : 1.  VTF스키닝 (Vertex Texture Fetch Skinning) - 텍스쳐로 매트릭스 팔레트를 전달한다. : VS에서 VTF로 Bone의 정보를 읽는다. 
                -> 메모리 사용량이 비교적 적지만 오버헤드가 심하다. 버텍스 하나당 최소 3번 ~ 최대 12번의 vtf가 필요하다. 
          2. R2VB (Render To Vertex Buffer Skinning ) - 매우 빠르지만 메모리 사용량이 비교적 많고 ATI GPU 즉 AMD GPU에서만 동작한다. 
          3. 소프트웨어 스키닝 : CPU 혹은 Compute Shader로 스키닝 처리 
                -> 멀티스레딩 최적화를 통해 성능과 메모리사용량 모두 좋으나 최적화 하기가 매우매우 어렵다. 

번외 : VT 스키닝(Vertex Texture Skinning) - 버텍스당 VTF를 1~1회만 하므로 VTF스키닝보다 매우 빠르다. 
       VT텍스쳐를 더블버퍼링하면 버텍스의 속도를 간단하게 계산할 수 있기때문에 오브젝트 모션블러 처리가 쉽다. 
     단점 - 메모리사용량이 높다. A32R32G32B32F 4장을 사용하는데, (1장은 이전프레임 텍스쳐) 적어도 1024 * 1024 크기의 VT텍스쳐가 필요하다.  중요한건 개어려움

결론 : VTF스키닝 결정 
*/
